package com.example.user.diplom_2.DB;

import android.database.sqlite.SQLiteDatabase;

public class Inserter {
    SQLiteDatabase data;


    public Inserter(SQLiteDatabase db) {
        this.data = db;
    }
    public void InsertF(){

        data.execSQL("DELETE FROM fountain ");
        data.execSQL("INSERT INTO fountain VALUES ('Свето- музикальниый','У червні 2016 роки зявився на Набережній в Аркадії світло- музичний фонтан. Це перший співаючий фонтан в Одесі і другий в Україні. Вдень він часто не працює, але зате кожен вечір у величезному басейні злітають вгору десятки різнокольорових струменів води у вигляді незвичайних фігур. ','Аркадія','https://od.vgorode.ua/news/obzory/306762-prohulky-po-odesse-10-samykh-krasyvykh-fontanov-horoda','46.4299559','30.7627111');");
        data.execSQL("INSERT INTO fountain VALUES ('Гранітний фонтанний комплекс','У травні 2015 року, закінчилося будівництва довгоочікуваного парку. Прекрасне місце для прогулянок і відпочинку в центрі парку. Гранітний фонтанний комплекс включає в себе музичний фонтан, який грає світлом (еквалайзери налаштовані так, що світло і струмені бють в одному ритмі з музикою) і прекрасні ковані дерева, прикрашені живими квітами. Фонтан працює з 10.00 до 23.00 для всіх відвідувачів парку з квітня по листопад.\n ','Парк Горького','https://ua.igotoworld.com/ru/poi_object/78025_park-kultury-i-otdyha-gorkogo.htm','46.4295938','30.7166166');");
        data.execSQL("INSERT INTO fountain VALUES ('Фонтан на  Ланжероні','Цей фонтан зявився на Ланжероні в 2012 році біля одеського дельфінарію. Фонтан зроблений таким чином, що струмені начебто бють з-під землі на всій території площі. Всього таких струменів в фонтані дванадцять. Вони піднімаються на півтора-два метри і навколо кожної завжди сила-силенна дітвори і фотографуються туристів. Вечорами кожна струмінь фонтану підсвічена.','Пляж Ланжерон, 25','https://histodessa.ru/fontan-na-lanzherone/','46.477446','30.7642448');");
        data.execSQL("INSERT INTO fountain VALUES ('Фонтан біля Оперного театру','Два фонтану доповнюють архітектурний ансамбль навколо театру. Тут обовязково фотографуються молодята, купаються випускники і влаштовують водні битви. Правда саме через його популярності фонтан постійно страждає - у нього ламаються або пропадають форсунки.\n" +
                "\n" +
                "  Цей фонтан вважається найбільшим в Одесі.','Переулок Чайковського 6','https://odportal.com.ua/uliza/pamatnik/fontanopera.html','46.4851814','30.7408604');");
        data.execSQL("INSERT INTO fountain VALUES ('Фонтан в  Міському саду','Це один з перших фонтанів, що зявилися в Одесі. Він відкрився в 1875 році з появою в місті водопроводу. У 2006 році він пережив грандіозну реконструкцію - центральну чашу відтворили саме такою, якою вона була 200 років тому. Також відреставрували і оригінальний карарский мармур чаші.\n" +
                "Якийсь час фрнтан був світломузикальним. На жаль, зараз він працює в звичайному режимі. Зате біля нього в Горсаду можна послухати живий оркестр і потанцювати на майданчику перед ротондою.','Вулиця Дерибасівська','https://hotelribas.com/news/gorodskoy-sad-odessa/','46.4849749','30.7340169');");

        data.execSQL("INSERT INTO fountain VALUES ('Пале- Рояль','Фонтан \"Німфа\" знаходиться на території затишного дворика-скверу Пале-Рояль, недалеко біля Оперного театру. Його звели ще в середині 19 століття. Ходять чутки, що його придумала сама графиня Єлизавета Воронцова - дружина одеського генерал-губернатора і муза Пушкіна.\n" +
                "З тих пір деталі памятника не раз мінялися, але маленька бронзова дівчина на вершині скелі залишається одним з найбільш витончених фонтанчиків в Одесі.','Вулиця Ланжеронівська, 10','https://odportal.com.ua/uliza/pamatnik/fontanpale.html','46.4852783','30.7401879');");

        data.execSQL("INSERT INTO fountain VALUES ('Парк Перемоги','Головна визначна памятка парку - це ставок з парою закоханих лебедів, десятками качечок, численними черепахами і звичайно ж фонтанами. Вони побудовані прямо в ставках. Проходячи по містку, можна охолодитися - краплі з фонтану освіжають все навколо. До речі, це найвищий фонтан в Одесі.\n" +
                "\n" +
                "Мало хто знає, але в парку є ще фонтан з невеликим водоспадом, на якому, дивлячись у воду, лежить оголена камяна жінка','Проспект Шевченко','http://dumskaya.net/news/v-parke-pobedy-otkryli-vosstanovlennyy-fontan-on-086318/','46.4454873','30.7523129');");

        data.execSQL("INSERT INTO fountain VALUES ('Фонтан  на  Старосінній  площі','А цей фонтан з підсвічуванням зявився на реконструйованій Старосінної площі зовсім недавно. Але одесити вже встигли зробити вибір нове місце і приходять туди вечорами з дітьми.\n" +
                "Також біля фонтанів тут зявилися скульптури дельфінів.','Старосінна  площа, 1','http://odessa-life.od.ua/news/42482-Na-Starosennoy-ploschadi-vnov-otkrylsya-volshebnyy-fontan-FOTO','46.4653297','30.7373414');");

        data.execSQL("INSERT INTO fountain VALUES ('Фонтан на Академіка Глушко','Вісім років тому в сквері навколо бюста академіка Валентина Глушка облаштували дитячий майданчик з гірками і гойдалками, розбили газони і зробили освітлення. Тоді тут і встановили фонтан-кульбаба. Це басейн діаметром в 6 метрів, в центрі якого триметрова труба з безліччю трубок. Так з струменів води утворюється великий кульбаба.\n" +
                "\n" +
                "Виглядає він набагато скромніше перерахованих вище, зате запамятовується своєю оригінальністю.\n','Проспект Академіка  Глушко','https://od.vgorode.ua/news/obzory/306762-prohulky-po-odesse-10-samykh-krasyvykh-fontanov-horoda','46.3999864','30.7298905');");

        data.execSQL("INSERT INTO fountain VALUES ('Фонтан на Соборній площі','Фонтан \"Ваза Філатова\" на Соборній площі, напевно, найзагадковіший в Одесі. Є кілька легенд про те, як він зявився. За однією з них, це перший одеський фонтан, який відкрили в 1973 році - на честь відкриття міського водопроводу. За іншою його встановили на місці підірваного Спасо-Преображенського собору.\n" +
                "\n" +
                "Також є версія, що його встановили на прохання відомого офтальмолога Володимира Петровича Філатова, який на власні кошти купив чашу. Спочатку басейн був облицьований рожевим гранітом і був у висоту 12 метрів.','Соборная площа,','http://volnorez.com.ua/novosti/interesnaya-odessa-fontan-puteshestvennik.html','46.4834528','30.7291117');");

        data.execSQL("INSERT INTO fountain VALUES ('Фонтан  в  Грецькому парку','16 серпня 2018 року встановили фонтан в Грецькому парку. Він являє собою образи чоловіка і жінки як зєднання двох начал. За ним з чотирьох жолобів тече вода.','Вулиця Приморська','https://www.048.ua/news/2130998/v-greceskij-park-odessy-dostavili-udivitelnyj-fontan-foto','46.489850','30.740583');");

    }

    public void InsertS(){
        data.execSQL("DELETE FROM park ");
        data.execSQL("INSERT INTO park VALUES ('Стамбульський  парк','Парк на схилах Приморського бульвару існував з XIX століття, переживаючи кращі і гірші часи в плані благоустрою. В останні роки сквер був досить занедбаний і в 2013 році у міської влади зародилася ідея його реконструювати до 20-річчя побратимських відносин між Одесою і Стамбулом. З того часу парк називається Стамбульських (Istanbul Park). На облаштування скверу було потрібно 1,5 мільйона доларів. Ландшафтний дизайн парку розробили турецькі фахівці, а висадкою рослин займалося комунальне підприємство «Міськзелентрест». У парку висадили квіткові клумби, які повторюють турецькі національні орнаменти.','На склоні Приморського бульвару','https://planetofhotels.com/ukraina/odessa/stambulskiy-park','46.487958', '30.742887');");
        data.execSQL("INSERT INTO park VALUES ('Грецький парк','Відкрито на день народження Одеси. Грецький бізнесмен, відкрив грецький парк в подарунок Одесі і одеситам від його родини, і подякував Богові за те, що він 24 роки тому опинився в нашому місті.\n" +
                "«Одеса - це прекрасне місто. Тут живуть прекрасні люди. Ми, греки, завжди любили і любимо чорноморську перлину. Сьогодні ми відкрили арт-зону Грецького парку. Це музей під відкритим небом, в який вкладено не тільки гроші, але і грецька душа. Я і моя сімя вдячні Одесі за те, що одного разу вона стала для нас другою домівкою. А свій будинок потрібно любити і прикрашати ». ','Біля Приморського бульвару','https://uc.od.ua/news/urbanism/1206300','46.488645', '30.741342');");

    }

    public void InsertP(){
        data.execSQL("DELETE FROM street ");
        data.execSQL("INSERT INTO street VALUES ('Рішельєвська','Вулиця Рішельєвська - невелика вулиця, розташована в Одесі від Ланжеронівської до Пантелеймонівській вулиць. Місце багато своєю історією. У XIX столітті тут знаходився одеський театр, засновником, якого, був Арман де Рішельє, в честь якого була названа вулиця. Також, деякий час вулиця носила назви: «Театральна», «Ім. В.І.Леніна ». Під час війни деякі будівлі сильно постраждали і були знесені, але вулицю незабаром забудували новими будинками. Раніше тут розташовувався готель, в якому зупинявся великий російський поет А.С. Пушкін. Тут же він трудився над твором «Євгеній Онєгін».','- будинок Білине-Фендеріх.\n" +
                "-Готель «Де Рішельє»\n" +
                "-Арабскій культурний центр, мечеть.\n" +
                "-Скульптура «Той, хто дивиться у вікно хлопчик на плечах батька».','http://obodesse.at.ua/publ/rishelevskaja_ulica/1-1-0-292','46.476719','30.7376861');");
        data.execSQL("INSERT INTO street VALUES ('Преображенська','Підстава вулиці доводиться на 1817 рік, і була названа на честь собору, який розташовувався неподалік. За часів радянської влади її неодноразово перейменовували - імені Льва Троцького, 10-річчя Червоної Армії, Міхая, Радянської армії - всі ці назви присуджували вулиці в різні роки і тільки в 1944, в рік здобуття незалежності України вулиці повернули первісне імя - Преображенська.','-Пассаж\n" +
                "-Спасо Преображенський кафедральний собор\n" +
                "-міський сад','http://culturemeter.od.ua/istorija-arhitektury-odessy-ulica-preobrazhenskaja-16770-2/','46.4796685','30.7305693');");
       /* data.execSQL("INSERT INTO park VALUES ('Фонтан на  Ланжероні','Цей фонтан зявився на Ланжероні в 2012 році біля одеського дельфінарію. Фонтан зроблений таким чином, що струмені начебто бють з-під землі на всій території площі. Всього таких струменів в фонтані дванадцять. Вони піднімаються на півтора-два метри і навколо кожної завжди сила-силенна дітвори і фотографуються туристів. Вечорами кожна струмінь фонтану підсвічена.','Пляж Ланжерон, 25','https://histodessa.ru/fontan-na-lanzherone/');");
        data.execSQL("INSERT INTO park VALUES ('Фонтан біля Оперного театру','Два фонтану доповнюють архітектурний ансамбль навколо театру. Тут обовязково фотографуються молодята, купаються випускники і влаштовують водні битви. Правда саме через його популярності фонтан постійно страждає - у нього ламаються або пропадають форсунки.\n" +
                "\n" +
                "  Цей фонтан вважається найбільшим в Одесі.','Переулок Чайковського 6','https://odportal.com.ua/uliza/pamatnik/fontanopera.html');");
        data.execSQL("INSERT INTO park VALUES ('Фонтан в  Міському саду','Це один з перших фонтанів, що зявилися в Одесі. Він відкрився в 1875 році з появою в місті водопроводу. У 2006 році він пережив грандіозну реконструкцію - центральну чашу відтворили саме такою, якою вона була 200 років тому. Також відреставрували і оригінальний карарский мармур чаші.\n" +
                "Якийсь час фрнтан був світломузикальним. На жаль, зараз він працює в звичайному режимі. Зате біля нього в Горсаду можна послухати живий оркестр і потанцювати на майданчику перед ротондою.','Вулиця Дерибасівська','https://hotelribas.com/news/gorodskoy-sad-odessa/');");

        data.execSQL("INSERT INTO park VALUES ('Пале- Рояль','Фонтан \"Німфа\" знаходиться на території затишного дворика-скверу Пале-Рояль, недалеко біля Оперного театру. Його звели ще в середині 19 століття. Ходять чутки, що його придумала сама графиня Єлизавета Воронцова - дружина одеського генерал-губернатора і муза Пушкіна.\n" +
                "З тих пір деталі памятника не раз мінялися, але маленька бронзова дівчина на вершині скелі залишається одним з найбільш витончених фонтанчиків в Одесі.','Вулиця Ланжеронівська, 10','https://odportal.com.ua/uliza/pamatnik/fontanpale.html');");

        data.execSQL("INSERT INTO park VALUES ('Парк Перемоги','Головна визначна памятка парку - це ставок з парою закоханих лебедів, десятками качечок, численними черепахами і звичайно ж фонтанами. Вони побудовані прямо в ставках. Проходячи по містку, можна охолодитися - краплі з фонтану освіжають все навколо. До речі, це найвищий фонтан в Одесі.\n" +
                "\n" +
                "Мало хто знає, але в парку є ще фонтан з невеликим водоспадом, на якому, дивлячись у воду, лежить оголена камяна жінка','Проспект Шевченко','http://dumskaya.net/news/v-parke-pobedy-otkryli-vosstanovlennyy-fontan-on-086318/');");

        data.execSQL("INSERT INTO park VALUES ('Фонтан  на  Старосінній  площі','А цей фонтан з підсвічуванням зявився на реконструйованій Старосінної площі зовсім недавно. Але одесити вже встигли зробити вибір нове місце і приходять туди вечорами з дітьми.\n" +
                "Також біля фонтанів тут зявилися скульптури дельфінів.','Старосінна  площа, 1','http://odessa-life.od.ua/news/42482-Na-Starosennoy-ploschadi-vnov-otkrylsya-volshebnyy-fontan-FOTO');");

        data.execSQL("INSERT INTO park VALUES ('Фонтан на Академік а Глушко','Вісім років тому в сквері навколо бюста академіка Валентина Глушка облаштували дитячий майданчик з гірками і гойдалками, розбили газони і зробили освітлення. Тоді тут і встановили фонтан-кульбаба. Це басейн діаметром в 6 метрів, в центрі якого триметрова труба з безліччю трубок. Так з струменів води утворюється великий кульбаба.\n" +
                "\n" +
                "Виглядає він набагато скромніше перерахованих вище, зате запамятовується своєю оригінальністю.\n','Проспект Академіка  Глушко','https://od.vgorode.ua/news/obzory/306762-prohulky-po-odesse-10-samykh-krasyvykh-fontanov-horoda');");

        data.execSQL("INSERT INTO park VALUES ('Фонтан на Соборній площі','Фонтан \"Ваза Філатова\" на Соборній площі, напевно, найзагадковіший в Одесі. Є кілька легенд про те, як він зявився. За однією з них, це перший одеський фонтан, який відкрили в 1973 році - на честь відкриття міського водопроводу. За іншою його встановили на місці підірваного Спасо-Преображенського собору.\n" +
                "\n" +
                "Також є версія, що його встановили на прохання відомого офтальмолога Володимира Петровича Філатова, який на власні кошти купив чашу. Спочатку басейн був облицьований рожевим гранітом і був у висоту 12 метрів.','Соборная площа,','http://volnorez.com.ua/novosti/interesnaya-odessa-fontan-puteshestvennik.html');");

        data.execSQL("INSERT INTO park VALUES ('Фонтан  в  Грецькому парку','16 серпня 2018 року встановили фонтан в Грецькому парку. Він являє собою образи чоловіка і жінки як зєднання двох начал. За ним з чотирьох жолобів тече вода.','Вулиця Приморська','https://www.048.ua/news/2130998/v-greceskij-park-odessy-dostavili-udivitelnyj-fontan-foto');");
*/
    }

}
